import { makeAutoObservable } from "mobx";

class ShopStore {
   shops = [
      {
         id: 0,
         name: "Здоровье+ Аптека",
         address: "ул. Васильковская, 10",

         medicines: [
            "Аспирин",
            "Парацетамол",
            "Ибупрофен",
            "Амоксициллин",
            "Лоратадин",
            "Нурофен",
            "Фенистил",
            "Антигриппин",
            "Цитрамон",
            "Дексаметазон",
         ],
      },
      {
         id: 1,
         name: "Фармацевтика Решений",
         address: "пр. Велика Васильковская, 25",
         medicines: [
            "Валериана",
            "Аспикор",
            "Ринзасип",
            "Синупрет",
            "Дексалгин",
            "Мезим",
            "Каламин",
            "Ибупрофен",
            "Диклофенак",
            "Парацетамол",
         ],
      },
      {
         id: 2,
         name: "Витаминная Оазис Аптека",
         address: "ул. Поповича, 5",
         medicines: [
            "Эспумизан",
            "Панадол",
            "Кетонал",
            "Церукал",
            "Супрастин",
            "Папаверин",
            "Эреспал",
            "Аспирин",
            "Лоперамид",
            "Фенкарол",
         ],
      },
   ];

   currentShop = 0;

   constructor() {
      makeAutoObservable(this);
   }

   changeShop(payload) {
      this.currentShop = payload;
   }
}

export default new ShopStore();
